import UIKit

// 1. შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა და დაბეჭდეთ მათი ნამრავლი.
let firstNum = 2
let secondNum = 5
let thirdNum: Int = 3 // Type ის მითითება საჭირო არაა, თუმცა ერთი ასეც ჩავწერე
print(firstNum * secondNum * thirdNum)

// 2. შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი ტერნარი ოპერატორით.
let oddOrEven = 9
print(oddOrEven % 2 == 0 ? "ლუწია" : "კენტია")

// 3. შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ
var firstName: String? = "Luka"
// if let firstName = firstname ს დაწერაც შეიძლებოლა.
if let myName = firstName {
    print(myName)
}

// 4. შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება”.
var isRaining: Bool
isRaining = false
if isRaining {
    print("ქოლგის წაღება არ დამავიწყდეს")
} else { print("დღეს ქოლგა არ დამჭირდება") }

// 5. შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”
let a = 7
let b = 12
if a > b {
    print("a მეტია")
} else { print("b მეტია") }

// 6. შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა.
let firstCharacter: Character = "L"
/*
 ან ჯერ უბრალოდ შევქმნიდით და შემდეგ მივანიჭებდით
 let firstCharacter: Character
 firstCharacter = "L"
 */

// 7. მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე რიცხვებისაგან შემდგარი
let seventh = 44
if seventh / 10 == seventh % 10 {
    print("რიცხვი ერთი და იმავე ციფრებისგანაა შემდგარი")
} else { print("რიცხვი სხვადასხვა ციფრებისგანაა შემდგარი") }

// 8.აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად.
var numberOfMonths = 12
if numberOfMonths < 3 || numberOfMonths == 12 {
    print("ზამთარია")
} else if numberOfMonths < 6 {
    print("გაზაფხულია")
} else if numberOfMonths < 9 {
    print("ზაფხულია")
} else { print("შემოდგომაა") }

/* ___________________________________

 აქ ისე მაქვს დალაგებული else if - ები, რომ არაა საჭიროება ასეთი პირობის დაწერის :
 else if (numberOfMonths < 6 && numberOfMonths >= 3) {
     print("გაზაფხულია")
 }
 ამიტომ, შევამოკლე ამგვარი დალაგებით.

 ___________________________________ */

// 9.შექმენით მთელი რიცხვის მქონე ცვლადი. თუ ეს ცვლადი იყოფა 3-ზე, დაბეჭდეთ “იყოფა 3-ზე”, თუ ეს ცვლადი იყოფა 4-ზე დაბეჭდეთ “იყოფა 4-ზე”, თუ იყოფა ორივეზე დაბეჭდეთ “იყოფა 3-ზე და 4-ზე”
let optional1 = 12
if optional1 % 3 == 0 && optional1 % 4 == 0 {
    print("იყოფა 3-ზე და 4-ზე")
} else if optional1 % 3 == 0 {
    print("იყოფა 3-ზე")
} else if optional1 % 4 == 0 {
    print("იყოფა 4-ზე")
}

// 10. შექმენით ორი რიცხვითი ცვლადი num1, num2 და რაიმე String ტიპის ცვლადი რომელსაც ტერნარული ოპერატორის საშუალებით მიანიჭებთ “თანაბრად დაშორებულია ნულიდან” / “არ არის თანაბრად დაშორებული ნულიდან” შესაბამის მნიშვნელობას რომელსაც აკმაყოფილებს მოცემული ორი ცვლადი

let num1 = -4
let num2 = 4
var distanceChecker: String
distanceChecker = (abs(num1) == abs(num2)) ? "თანაბრადაა დაშორებული ნულიდან" :
    "არ არის თანაბრად დაშორებული ნულიდან"

// abs (absolute) ფუნქციის გარდა შეიძლებოდა ესე გამოგვეთვალა
var distanceChecker2 = (num1 * num1 == num2 * num2) ? "თანაბრადაა დაშორებული ნულიდან" :
    "არ არის თანაბრად დაშორებული ნულიდან"

print(distanceChecker)
print(distanceChecker2)
